package ua.com.javatrainig.phaser;

public class PhaserMainClass {
//    В версии JDК 7 внедрен новый класс синхронизации под названием Phaser.
//    Главное его назначение - синхронизировать потоки исполнения, которые пред­
//    ставляют одну или несколько стадий (или фаз) выполнения действия.

//    Прежде всего следует иметь в виду, что класс Phaser действует подобно описан­
//    ному ранее классу CyclicBarrier, за исключением того, что он подцерживает не­
//    сколько фаз. В итоге класс Phaser позволяет'Ьпределить объект синхронизации,
//    ожидающий завершения определенной фазы.

//    Объекты, регистрируемые синхронизатором фаз, зачастую обозначаются термином сторона.
}
